# 2. Напишите код, который запрашивает число и сообщает является ли оно простым или составным.
# Используйте правило для проверки: “Число является простым, если делится нацело
# только на единицу и на себя”. Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.

num = int(input('Введите число от 0 до 100000: '))
while num < 0 or num > 100000:
    num = int(input('Введите число от 0 до 100000: '))

count = 0

for i in range(1, (num + 2) // 2):
    if num % i == 0:
        count += 1
        i += 1

if count > 1:
    print('Число не является простым')
else:
    print('Число является простым')