# В большой текстовой строке подсчитать количество встречаемых слов и вернуть 10 самых частых.
# Не учитывать знаки препинания и регистр символов.
# За основу возьмите любую статью из википедии или из документации к языку.

import re
from collections import Counter

def top_10_words(text):
    words = re.findall(r'\b\w+\b', text.lower())
    return Counter(words).most_common(10)

text = """В качестве подкласса dict(), класс Counter() унаследовал возможность 
запоминания порядка вставки. Математические операции над объектами Counter() также 
сохраняют порядок. Результаты упорядочены в соответствии с тем, когда элемент сначала 
встречается в левом операнде, а затем в порядке, в котором встречается правый операнд.
Предусмотрено несколько математических операций для объединения объектов Counter() 
для создания мультимножеств (счетчиков, число которых больше нуля). Сложение и вычитание 
объединяют счетчики путем сложения или вычитания количества соответствующих элементов. 
Пересечение и объединение возвращают минимум и максимум соответствующих отсчетов.
Каждая операция принимает счетчики, значения ключей которых могут иметь любые числа, 
но выходные данные исключают из результата ключи с нулевыми отрицательными значениями."""

print(top_10_words(text))
