# Создайте словарь со списком вещей для похода в качестве ключа и их массой в качестве значения.
# Определите какие вещи влезут в рюкзак передав его максимальную грузоподъёмность.
# Достаточно вернуть один допустимый вариант. *Верните все возможные варианты комплектации рюкзака.

my_dict = {'спички': 20,
           'нож': 100,
           'посуда': 500,
           'кружка': 300,
           'емкость для воды': 400,
           'спальник': 800,
           'мыло': 200,
           'одежда': 2000,
           'еда': 1000,
           'фонарик': 500}  # вес в граммах

weight = int(input('Enter weight in kilograms: ')) * 1000

backpack = []

for key, value in my_dict.items():
    if value <= weight:
        backpack.append(key)
        weight -= value
print(backpack)
