# Дан список повторяющихся элементов. Вернуть список с дублирующимися элементами.
# В результирующем списке не должно быть дубликатов. на входе [1,2,3,1,2,5,6] , на выходе [1,2]

list_1 = [1,2,3,1,2,5,6]
list_2 = list(set(list_1))

print(list_1, list_2, sep='\n', end='\n\n')

for i in list_2:
    if i in list_1:
        list_1.remove(i)
print(list_1)
